[
    {
        "url": "https://www.epicurious.com/recipes/food/views/chocolate-chip-banana-bread-with-walnuts",
        "ingredients": [
            "Nonstick cooking spray",
            "½ cup chopped walnuts",
            "1½ cups (188 g) all-purpose flour",
            "1 tsp. baking soda",
            "1 tsp. baking powder",
            "1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt",
            "½ cup semisweet chocolate chips",
            "½ cup (1 stick) unsalted butter, room temperature",
            "1 cup (200 g) granulated sugar",
            "2 large eggs",
            "1 cup mashed ripe bananas (from about 2 large bananas)",
            "2 Tbsp. fresh lemon juice",
            "2 tsp. vanilla extract"
        ],
        "steps": [
            "Step 1: Position a rack in the center of the oven and preheat to 350°F. Lightly coat a 9x5\" loaf pan withnonstick vegetable oil spray. Line with parchment paper, leaving overhang on long sides. Scatter½ cup chopped walnutson a rimmed baking sheet. Bake, tossing halfway through, until darkened in color and fragrant, 10–14 minutes. Let cool on baking sheet.",
            "Step 2: Whisk together1½ cups (188 g) all-purpose flour, 1 tsp. baking soda, 1 tsp. baking powder,and1 tsp. Diamond Crystal or ½ tsp. Morton Kosher saltin a medium bowl to combine. Combine½ cup semisweet chocolate chipsand the toasted, cooled walnuts in a small mixing bowl; add 1 Tbsp. flour mixture and toss to coat.",
            "Step 3: Beat½ cup (1 stick) unsalted butter, room temperaturein the bowl of an electric mixer fitted with a paddle attachment on medium speed until light and fluffy, about 2 minutes. (Alternatively, use a large bowl and electric hand mixer.) Add1 cup (200 g) granulated sugarand mix on medium speed until well combined and fluffy, 2–3 minutes. With the mixer running on medium speed, beat in2 large eggsone at a time, waiting until the first one is completely incorporated before adding the next. Add1 cup mashed ripe bananas (from about 2 large bananas), 2 Tbsp. fresh lemon juiceand2 tsp. vanilla extractand mix on medium speed until completely combined, about 1 minute. Add the flour mixture to the wet ingredients and mix just until combined, about 30 seconds to 1 minute. Fold in the walnut and chocolate chip mixture until well dispersed, then transfer to prepared loaf pan and bang pan on counter once or twice to even out batter and release any trapped air bubbles.",
            "Step 4: Bake until a toothpick inserted into the center comes out clean, about 55 minutes to 1 hour 5 minutes. Let cool in the pan for 15 minutes, then turn out onto a wire rack and let cool completely."
        ]
    },
    {
        "url": "https://www.epicurious.com/recipes/food/views/hot-buttered-rum",
        "ingredients": [
            "½ stick (¼ cup) unsalted butter",
            "¼ cup packed dark brown sugar",
            "1 tsp. cinnamon",
            "½ tsp. freshly grated nutmeg",
            "¼ tsp. ground cloves",
            "⅛ tsp. kosher salt",
            "⅔ cup aged dark rum"
        ],
        "steps": [
            "Not found"
        ]
    },
    {
        "url": "https://www.epicurious.com/recipes/food/views/spicy-honey-orange-shrimp",
        "ingredients": [
            "1 cup tapioca starch",
            "1 Tbsp. garlic powder",
            "1 tsp. salt",
            "1 tsp. ground black pepper",
            "7 oz./200 g shrimp or prawns, peeled and deveined",
            "1 Tbsp. orange zest",
            "½ cup orange juice",
            "3 Tbsp. liquid honey",
            "2 Tbsp. light soy sauce",
            "1 Tbsp. oyster sauce",
            "1 Tbsp. minced garlic",
            "1 tsp. grated peeled fresh ginger",
            "1 tsp. red chili flakes",
            "½ cup canola oil, for frying",
            "2 Tbsp. cornstarch",
            "Chopped scallions, both white and green parts, for garnish"
        ],
        "steps": [
            "Step 1: In a large bowl, stir together1 cup tapioca starch,1 Tbsp. garlic powder,1 tsp. salt, and1 tsp. ground black pepper. Add7 oz./200 g shrimp or prawns, peeled and deveined, and toss to evenly coat. Let the shrimp sit in the mixture for 5 minutes to ensure the coating sticks.",
            "Step 2: In a medium bowl, stir together1 Tbsp. orange zest,½ cup orange juice,3 Tbsp. liquid honey,2 Tbsp. light soy sauce,1 Tbsp. oyster sauce,1 Tbsp. minced garlic,1 tsp. grated peeled fresh ginger, and1 tsp. red chili flakes.",
            "Step 3: Heat½ cup canola oilin a large frying pan over medium-high heat until it reaches 350°F/180°C on a deep-frying thermometer. Add the shrimp to the hot oil and fry for 2–3 minutes per side, until golden brown. Using a spider or metal tongs, transfer the shrimp to a plate lined with paper towel to absorb excess oil. Pour out the oil and wipe the pan.",
            "Step 4: Reduce the heat to medium. Pour the sauce into the same pan and simmer for 2–3 minutes, until fragrant.",
            "Step 5: In a small measuring cup, stir together2 Tbsp. cornstarchand3 Tbsp. cold wateruntil smooth.",
            "Step 6: Pour the cornstarch mixture into the sauce and stir until combined. Simmer the sauce for 1 minute, or until it has thickened. Increase the heat to high, add the shrimp to the sauce, and sauté for another 1 minute.",
            "Step 7: Transfer to a plate and garnish withchopped scallions, both white and green parts. Serve immediately."
        ]
    },
    {
        "url": "https://www.epicurious.com/recipes/food/views/passion-fruit-olive-oil-cake",
        "ingredients": [
            "1⁄2 cup (105 g) extra-virgin olive oil, plus more for greasing the pan",
            "3⁄4 cup (150 g) sugar",
            "3 large eggs",
            "2⁄3 cup (175 g)passion fruit curdfor the batter, plus 2⁄3 cup (175 g) for the swirls",
            "1⅓ cups (175 g) all-purpose flour",
            "1¼ tsp. salt",
            "1 tsp. baking powder"
        ],
        "steps": [
            "Step 1: Preheat oven to 375°. Grease a 9\" cake pan withextra-virgin olive oiland line bottom with a parchment round.",
            "Step 2: Place1⁄2 cup (105 g) extra-virgin olive oil,3⁄4 cup (150 g) sugar,3 large eggs, and2⁄3 cup (175 g) passion fruit curdin a mixing bowl. Stir together until completely homogenous.",
            "Step 3: Sift1⅓ cups (175 g) all-purpose flour,1¼ tsp. salt, and1 tsp. baking powderinto wet ingredients. Stir just until combined (do not overmix).",
            "Step 4: Scrape batter into prepared cake pan, smooth out, then top it evenly with spoonfuls of remaining2⁄3 cup (175 g) passion fruit curd. You should end up with about 12 spoonfuls spaced across the surface. Drag the back of your spoon through the cake in figure-eights so that you catch each blob once or twice. You should end up with thin swirls across the surface (don’t overswirl or it will affect the texture of the cake).",
            "Step 5: Bake for about 30 minutes, until a tester inserted into center of cake (avoiding the passion fruit) comes out clean. Let it sit for about 3 minutes in the pan, then trace around the edge with a knife, invert cake onto a parchment-covered plate, peel parchment from the bottom, and invert again onto a wire rack. Peel parchment from top and let cake cool before slicing."
        ]
    },
    {
        "url": "https://www.epicurious.com/recipes/food/views/tuna-melt-nachos",
        "ingredients": [
            "4 cups sturdy corn tortilla chips",
            "2 (3.2-oz.) tins oil-packaged tuna, such as Fishwife Albacore Tuna, flaked into bite-size pieces",
            "½ cup cooked or canned black beans, drained",
            "⅓ cup sliced black olives",
            "½ cup shredded Monterey Jack cheese",
            "¼ cup pickled jalapeño slices",
            "¼ cup sour cream",
            "⅓ cup finely chopped scallions",
            "1 small handful of fresh cilantro leaves (optional)"
        ],
        "steps": [
            "Step 1: Preheat the broiler.",
            "Step 2: Spread4 cups sturdy corn tortilla chipsout in an even layer on a baking sheet. Evenly distributetwo 3.2-oz. tins oil-packaged tuna, flaked into bite-size pieces,½ cup cooked or canned black beans, drained, and⅓ cup sliced black oliveson top. Sprinkle½ cup shredded Monterey Jack cheeseall over.",
            "Step 3: Broil for 2–5 minutes, until the cheese has melted and is starting to caramelize. Keep a close eye on the nachos, as they’ll go from meltingly delicious to burnt in a blink.",
            "Step 4: Top with¼ cup pickled jalapeño slices, dollops of¼ cup sour cream, a scattering of⅓ cup finely chopped scallions, and1 small handful of fresh cilantro leaves, if desired."
        ]
    }
]